{
  "ofExperience": "erfaring",
  "experience": "erfaring",
  "years": "친r",
  "months": "m친ned(er)",
  "days": "dag(er)",
  "topBar": {
    "dashboard": "dashbord",
    "contact": "kontakt patrick",
    "education": "Kursbevis & Attester",
    "references": "Referanser",
    "darkMode": "Veksle m칮rk modus",
    "languagePicker": "Endre spr친k"
  },
  "dashboard": {
    "about": "Om patrick",
    "content1": "Hei 游때 jeg er en {age} 친r gammel full stack utvikler fra Larvik, Norge. Jeg tar stolthet i arbeidet mitt, og liker 친 jobbe med leveringene mine inntil jeg er stolt av resultatet. Jeg strever for 친 forbedre meg selv profesjonelt uansett hvor god jeg m친tte bli.",
    "content2": "Jeg er en objektiv tenker, som er flink til 친 identifisere problemer og finne l칮sninger til dem. Jeg liker 친 jobbe tett med produkt avdelingen for 친 pitche ideer ideer til det vi lager, siden jeg f친r kreative inspirasjoner mens jeg jobber.",
    "content3": "Utenfor jobb s친 bruker jeg tid med venner, ser filmer, spiller pathfinder, nyter dokumentarer og spiller video spill. Jeg liker 친 bruke tid p친 spill utvikling og andre kreative side prosjekter.",
    "content4": "Jeg ble f칮rst introdusert til programmering n친r jeg gikk p친 folkeh칮yskolen tilbake i 2016, og fallt for spill utvikling det 친ret. Jeg l칝rte og bruke programmering for mer bedrifts relaterte form친l n친r jeg gikk p친 Get Academy i 2019, og har en total erfaring med programming p친 {experience},",
    "content5": "men jeg har {experience} erfaring med programmering profesjonelt"
  },
  "hobbiesList": {
    "title": "Hobbyer & Fritids aktiviteter",
    "hobbyHeader": "Hobbyer",
    "gameDevelopment": "Spill Utvikling",
    "streaming": "Str칮mming"
  },
  "gameDevelopment": {
    "title": "Spill Utvikling",
    "content1": "Jeg l칝rte spill utvikling for f칮rste gang da jeg gikk p친 Bjerkely Folkeh칮yskole i 2016-2017. Mens jeg var der l칝rte jeg 친 programmere C# i Unity engine, og jeg l칝rte 친 bruke Unity engine generelt sett. Jeg l칝rte ogs친 det grunnleggende med 3d modellering i Blender, og putte teksturer p친 3d modeller, det inkluderer ogs친 친 lage teksturer som simulerer 3d med hjelp av bump maps, og som har metadata ang친ende ting som hvordan lys oppf칮rer seg n친r det treffer teksturen med bruk av diffusion maps. Prosjektene jeg har laget det 친ret er borte siden jeg ikke jobbet med noen teknologier som holdt p친 backups.",
    "content2": "Men jeg har laget noen spill siden jeg forlot skolen ogs친, jeg har laget et mobil spill som jeg hadde lastet opp til Google Play store i en begrenset periode inntil det ble fjernet av google, det het FlurryTurry og det var et relativt morsomt towe defence spill jeg hadde lagd.",
    "content3": "Grunnen til at spillet ble tatt den fra Google Play store var fordi jeg hadde brukt en SDK, en pakke med vertkt칮y for 친 lage builds til spillet mitt som ogs친 inneholdt verkt칮y for 친 lage kj칮pe funksjonalitet med ekte penger inni spillet, ikke at jeg visste om dette og hadde heller ikke tatt i bruk disse verkt칮yene, men siden dette var en del av et st칮rre verkt칮ysett jeg hadde brukt i spillet, s친 trodde google at spillet mitt hadde slike kj칮p i app funksjoner. Siden jeg ikke hadde 칝rklert noen kj칮p i app funksjoner til google s친 tok de spillet mitt ned fra Google Play store. S친 dette var en misforst친else, men jeg klarte ogs친 친 korruptere prosjektet mitt ved uhell n친r jeg uheldigvis oppdaterte Unity til en beta versjon istedenfor en stabil versjon, noe som gjorde det umulig for meg 친 fikse problemet mitt med google ved 친 lage en ny build av spillet.",
    "content4": "Jeg har ogs친 laget et Console App text basert eventyr spill som heter Ogrevent, som er tiljengelig for nedlasting",
    "here": "her",
    "content5": "Spill utvikling er noe jeg finner underholdene, men det er ogs친 veldig tids konsumerende og vanskelig 친 gj칮re alene, s친 det er ikke noe jeg kommer meg rundt til 친 f친 drevet med veldig ofte."
  },
  "pathfinder": {
    "title": "Pathfinder",
    "content1": "Pathfinder er et",
    "tabletopLink": "tabletop rollespill",
    "content2": "de fleste som har h칮rt om tabletop rollespill, har som regel h칮rt om Dungeons & Dragons.",
    "content3": "Pathfinder er som Dungeons & Dragons men med andre regler.",
    "content4": "Jeg og noen venner samles innimellom, kansje annen v칝r uke, s친 ruller vi terninger og har det g칮y med 친 spille Pathfinder sammen."
  },
  "streaming": {
    "title": "Str칮mming",
    "content1": "Innimellom s친 str칮mmer jeg spill p친 twitch, det er noe jeg gj칮r fordi jeg synes det er g칮y, og er ikke noe jeg gj칮r i profesjonell kapasitet, eller har lyst til 친 gj칮re i noen profesjonell kapasitet."
  },
  "technicalList": {
    "title": "Teknisk Kompetanse",
    "codeLanguageHeader": "Programmeringsspr친k",
    "technologyHeader": "Teknologier",
    "frameworkHeader": "Rammeverk",
    "methodologyHeader": "Arbeids Metoder",
    "packageManagerHeader": "Pakkeforvaltere"
  },
  "angularJs": {
    "title": "AngularJS",
    "content": "Jeg har erfaring med en eldre versjon av AngularJS fra min tid i ABAX, hvor jeg pleide 친 gj칮re vedlikehold og fiksing av bugs som innimellom involverte 친 fikse ting som ikke fungerte som forventet i frontenden. S친 i den perioden ble jeg kjent med AngularJS."
  },
  "bootstrap": {
    "title": "Bootstrap",
    "content": "Bootstrap er det f칮rste stylng fokuserte biblioteket jeg har noengang tatt i bruk. Jeg l칝rte 친 bruke det f칮rst i Get Academy, men har ogs친 brukt det i ABAX. Det er v칝rt 친 nevne at den m친ten Bootstrap ble brukt i ABAX gjorde at Bootstrap var veldig tilpasset og endret og ikke vanlig Bootstrap."
  },
  "csharp": {
    "title": "Csharp",
    "content1": "Jeg l칝rte C# i 2016-2017 n친r jeg gikk p친 Bjerkely Folkeh칮yskole, hvor jeg studerte spill utvikling. Det er mange forkjellige roller og retninger man kan velge n친r det kommer til spill utvikling. Et spill har ofte bilder, animasjoner, 3d modeller eller 2d sprites, lyd effekter, musikk og s친klart kode som dikterer oppf칮rselen og spiller interaksjonen i spillet. Det var programmeringen som fanget min interesse mest. S친 jeg brukt majoriteten av tiden min det 친ret p친 친 l칝re 친 skrive C# i Unity.",
    "content2": "Etter 친ret mitt p친 Bjerkely s친 drev jeg fortsatt med spill utvikling fra tid til annen, men f친 av prosjektene mine ble til noe ferdig spill siden jeg ikke hadde noen kunstnere eller animat칮rer eller lyd teknikere 친 jobbe sammen med, s친 selv om jeg kunne f친 koden til spillet til 친 fungere bra, s친 begynte motivasjonen min 친 svikte ganske raskt ettersom at jeg inns친 at uten andre folk med disse andre kompetanseomr친dene kunne jeg ikke f친 spillet mitt til 친 se eller h칮res bra ut.",
    "content3": "I 2019 n친r jeg gikk p친 Get Academy s친 l칝rte jeg mer om 친 bruke C# for form친l tiln칝rmet bedrifters behov og form친l, og l칝rte og lage REST apier med .net framework. Jeg l칝rte enda mer om dette n친r jeg senere samme 친ret begynte som l칝rling hos ABAX og fikk erfaring med 친 vedlikeholde og fikse bugs i WebApiet deres, som var .net framework, men jeg ville senere ogs친 opplveve apier i moderne .net core. Jeg har ogs친 brukt C# til 친 konsumere og avgi events over meldingsk칮er (RabbitMQ) mens jeg var hos ABAX. Jeg har ogs친 skrevet masse enhetstester og integrasjonstester i XUnit, med bruk av Substitutes for kall til eksterne tjenester og datakilder n친r jeg skrev enhetstester.",
    "content4": "Jeg har ogs친 laget et Console App tekst eventyr spill som er tiljengelig p친 github profilen min."
  },
  "docker": {
    "title": "Docker",
    "content": "Jeg l칝rte om Docker n친r jeg startet i ABAX, jeg har brukt det til 친 skrive Dockerfiler for 친 pakke inn programmer, jeg har ogs친 brukt det for docker-compose. Jeg har gjort meg kjent med build og run kommandolinje instruksene med forkjellige flagg som h칮rer til disse. Jeg har ogs친 brukt Docker desktop sitt GUI."
  },
  "googleFirebase": {
    "title": "Google Firebase",
    "content": "Jeg har brukt google firebase som database teknologi n친r jeg jobbet p친 en dating app som Get Academy fikk i oppdrag 친 lage av en kunde. I den databasen lagret jeg ting som brukernavn og passord og profil bilder, og annen bruker informasjon."
  },
  "javascript": {
    "title": "Javascript",
    "content1": "Jeg l칝rte Javascript n친r jeg started p친 Get Academy i 2019, og jeg har bare brukt det til 친 lage web applikasjoner.",
    "content2": "Det f칮rste ekte prosjektet jeg jobbet p친 hvor Javascript ble bruk, var n친r Get Academy ble gitt oppdrag om 친 lage et proof of concept for en dating app, som jeg ble delegert til 친 jobbe p친. Den f칮rste iterasjonen var laget med bare javascript, html og css, senere s친 refaktorerte jeg l칮sningen i Vue rammeverket, og med bootstrap som var f칮rste gangen jeg ogs친 brukte et rammeverk.",
    "content3": "Under tiden min hos ABAX s친 ble javascript brukt en del i vedlikehold eller implementasjonen av nye l칮sninger for litt forkjellige frontender der, og jeg l칝rte og utviklet egenskapene mine med Javascript der."
  },
  "kanban": {
    "title": "Kanban",
    "content": "Gjennom tiden min i ABAX s친 har jeg holdt styr p친 oppgavene mine ved bruk av kanban boards. Jeg har brukt Jira og Gitlab boards prim칝rt til 친 holde styr p친 de oppgavene jeg personlig jobber med. Men har ogs친 brukt Monday til 친 tracke roadmap oppgaver, de oppgavene er som regel st칮rre oppgaver som er forventet 친 strekke seg over lengre tid, de oppgavene jeg jobber med i Gitlab er oppdelte biter av en roadmap oppgave som regel."
  },
  "mongoDb": {
    "title": "MongoDB",
    "content1": "jeg begynte 친 bruke MongoDB for f칮rste gang n친r jeg jobbet i ABAX, i den tiden s친 l칝rte jeg 친 bruke verkt칮y som Mongo Compass og Studio 3T. I tillegg s친 har jeg brukt Mongo Shell fra tid til annen. I tiden jeg har brukt MongoDB s친 har jeg l칝rt:",
    "listItem1": "Hvordan jeg bruker C# driveren",
    "listItem2": "Hvordan jeg lager Indexer, inkluderende {TTL} indexer {TTLText}",
    "listItem3": "Hvordan jeg skriver queries med C# driveren",
    "content2": "Jeg har ogs친 brukt MongoDB i et personlig prosjekt hvor jeg lagret pdf dokumenter som base64 string p친 databasen"
  },
  "mssql": {
    "title": "Mssql",
    "content1": "Jeg l칝rte the grunnleggende av sql querying for f칮rste gang n친r jeg gikk p친 Get Academy. Jeg fikk en dypere forst친else for querying spr친ket n친r jeg jobbet hos ABAX. Under tiden min hos ABAX s친 har jeg skrevet kompliserte queries, og jeg har l칝rt om:",
    "listItem1": "Indekser",
    "listItem2": "Hvordan treffe indekser",
    "listItem3": "Hvordan m친le ytelse",
    "listItem4": "Hvordan man forbedrer ytelsen til queries",
    "listItem5": "Hvordan man kobler sammen databaser",
    "listItem6": "Hvordan man jobber med temp tabeller",
    "listItem7": "Hvordan man setter opp transaksjoner og bruker dem til 친 gjennomf칮re eller rulle tilbake endringer",
    "content2": "Personlig s친 foretrekker jeg relasjons database teknologier over dokument database teknologier generelt sett, men det er styrker og svakheter ved begge."
  },
  "npm": {
    "title": "Node Package Manager (NPM)",
    "content": "Node Package Manager er den package manageren som jeg har brukt mest i alle frontend applikasjonene jeg har jobbet med. Og har derfor l칝rt en del om kommandoene som h칮rer til det, men jeg har l칝rt hvordan jeg setter sammen mine egne kommandoer hvor jeg syr sammen fler forkjellige kommandoer for enkel bruk med hjelp av && syntaksen mellom v칝r kommando."
  },
  "nuget": {
    "title": "NuGet",
    "content": "NuGet er den package manageren jeg har brukt mest n친r det kommer til 친 installere og oppdatere pakker til .net prosjektene jeg har jobbet p친."
  },
  "paket": {
    "title": "Paket",
    "content": "Jeg har brukt paket til 친 installere avhengiheter til et .net framework WebApi prosjekt som hadde paket som dens m친te av 친 hente pakker p친. Paket var ogs친 brukt til 친 l친se versjonen av pakkene i det prosjektet siden prosjektet var ganske legacy, ting brakk og slutten 친 fungere viss pakkene ble oppdatert til siste versjon. En uheldig bivirkning av at prosjektet var i den Legacy tilstanden den var i p친 den tiden, Men over tid s친 ble tilstanden gradvis forbedret. S친 min erfaring med Paket er rimelig begrenset til hvordan det ble brukt i det ene prosjektet."
  },
  "rabbitMq": {
    "title": "RabbitMQ",
    "content": "Jeg har brukt RabbitMQ til 친 konsumere og sende ut meldinger i C# backender, jeg har ogs친 brukt RabbitMQ sitt GUI hvor jeg har sett p친 error meldinger i error k칮er og l칝rt forkjellen mellom nack og ack. Jeg har ogs친 l칝rt hvordan jeg flytter meldinger fra en k칮 til en annen med det grensesnittet."
  },
  "ravenDb": {
    "title": "RavenDB",
    "content": "Jeg har bare brukt RavenDB littegrann, men jeg har brukt det til 친 endre dokumenter i web grensesnittet, og har ogs친 lastet ned og lastet opp collections."
  },
  "scrum": {
    "title": "Scrum",
    "content": "Mens jeg har jobbet i ABAX s친 har vi brukt SCRUM rammeverket for 친 holde styr p친 arbeidet og for 친 arbeide effektivt, vi holdt Standup m칮ter om morgenen, der byttet vi p친 친 forklare hva vi gjorde forrige arbeidsdag og om vi satt fast / trengte hjelp fra noen p친 teamet med noe. Vi estimerte hvor lang tid vi trodde oppgavene v친res ville ta og br칮yt oppgavene ned i mindre oppgaver, som er lettere 친 definere i tekniske gj칮rem친l som vi trengte 친 gj칮re for 친 bli ferdig. S친 jobbet vi med de mindre oppgavene v친res i et Kanban board. Vi holdt ukentlige m칮ter sammen med teamets Business Analyst for 친 ta en oppdatering p친 progresjonen p친 oppgaver vi aktivt jobbet med, og for 친 se p친 specs til oppgaver som vi skulle starte med i n칝rmere fremtid og se p친 n친r disse nye oppgavene burde begynne 친 bli jobbet med iforhold til progresjonen p친 n친v칝rende oppgaver."
  },
  "typescript": {
    "title": "Typescript",
    "content1": "Jeg har bare brukt Typescript littegrann, men jeg har en grunnleggende forst친else for det. Jeg har brukt Typescript fra tid til annen n친r jeg jobbet p친 en relativt stor frontend refaktorerings prosjekt for ABAX, til noen spesifikke komponenter som krevde Typescript. Men for det meste har jeg brukt Javascript n친r jeg jobbet med det prosjektet.",
    "content2": "Men jeg har fortsatt f친tt erfaring med Typescript, s친 jeg ville ikke startet fra ingenting om jeg skulle m칮te p친 det igjen i fremtiden."
  },
  "visualBasic": {
    "title": "Visual Basic",
    "content": "Jeg har bare brukt Visual Basic til 친 vedlikeholde Legacy kode baser, men har i en tiden laget l칮sninger p친 bugs i et SOAP api og skrevet Unit tester. Jeg har ogs친 konvertert store mengder med Visual Basic kode til C#."
  },
  "vueRouter": {
    "title": "Vue Router",
    "content1": "Vue Router er en valgfri pakke som kan brukes i Vue applikasjoner. Det gj칮r det lettere 친 navigere mellom forkjellige sider inni applikasjonen, som gj칮r det lettere 친 gj칮re applikasjonen til en {SPA} {SPAText} applikasjon. De fleste moderne nettsider er en eller annen form for {SPA} applikasjon siden det 친 gj칮re en full lasting bare for 친 navigere til et annet sted p친 samme nettsted er for det meste en ting i fortiden.",
    "content2": "Alle Vue prosjekter jeg har jobbet med har brukt Vue Router, inkludert denne!"
  },
  "vue": {
    "title": "Vue",
    "content1": "Vue er det f칮rste rammeverket jeg l칝rte 친 bruke, og det er ogs친 favoritt rammeverket mitt ut av de forkjellige rammeverkene av dens type som jeg har hatt gleden av 친 erfare gjennom karrieren min. Jeg brukte det for f칮rste gang da jeg refaktorerte en dating app som jeg jobbet med tilbake p친 Get Academy. S친 brukte jeg det igjen i noen l칝re prosjekter hvor fokuset mitt var prim칝rt p친 친 l칝re noen andre teknologier enn Vue. En tid etter dette s친 brukte jeg rammeverket mens jeg jobbet p친 et prosjekt fokusert p친 친 refaktorere en frontend fra en eldre versjon av AngularJS til Vue3 for ABAX. Etter det prosjektet jobbet jeg med vedlikehold og utvikling av nye interne verkt칮y som ogs친 brukte Vue i frontenden sin.",
    "content2": "Jeg er hovedsaklig kjent med 친 skrive Vue i options api, men har ogs친 en grunnleggende forst친else for compositions apiet.",
    "content3": "Denne nettsiden er ogs친 skrevet i Vue!"
  },
  "vuetify": {
    "title": "Vuetify",
    "content1": "Vuetify var rammeverket vi brukte for de interne verkt칮yene i ABAX, det er et rammeverk som virkelig har grodd p친 meg.",
    "content2": "Denne nettsiden er ogs친 skrevet med Vuetify!"
  },
  "vuex": {
    "title": "Vuex",
    "content1": "Vuex er en global holder av data tilstanden som er en valgfri pakke som kan brukes til Vue applikasjoner. Jeg h칮rte om det tilbake p친 Get Academy men tok det ikke i bruk f칮r jeg startet 친 jobbe med de interne verkt칮yene i ABAX. Men jeg er glad for at jeg fikk muligheten til 친 jobbe med det og jeg er en stor fan av det n친 som jeg er blitt kjent med det.",
    "content2": "Denne nettsiden er ogs친 skrevet med Vuex!"
  },
  "yarn": {
    "title": "Yarn",
    "content": "Jeg brukte Yarn i en kort periode for 친 installere avhengigheter til frontenden av et prosjekt fordi viss du installerte de avhengighetene med NPM s친 ville det ikke fungere av grunner vi aldri unders칮kte dypere. Men vi fant ut at viss du bare installerte avhengighetene med Yarn s친 fungerte det helt fint, s친 vi bare brukte det for det spesifikke prosjektet, inntil en dag hvor NPM fungerte med det prosjektet ogs친. Dette var ganske tidlig i min l칝rlingsperiode hos ABAX."
  },
  "contact": {
    "contactByEmail": "Kontakt meg p친 e-post",
    "subject": "Emne",
    "messageBody": "Meldingstekst",
    "sendEmail": "Send e-post",
    "contactInfo": "Kontakt info",
    "phoneLabel": "Telefon nummer",
    "emailLabel": "Epost"
  },
  "education": {
    "title": "Kursbevis & Attester",
    "highSchool": "Vidreg친ende",
    "codeBootcamp": "Programmerings kurs",
    "recommendation": "Attest",
    "certificate": "Kursbevis"
  },
  "references": {
    "title": "References"
  }
}